In [3]:
#importing pandas dictionary
import pandas as pd

lyst = ['CSC', '102', 'is', 'the', 'best', 'course', 'ever']

#Calling DataFrame constructor
df = pd.DataFrame(lyst)

#Print the output
df

        0
0     CSC
1     102
2      is
3     the
4    best
5  course
6    ever

In [15]:
#Now this is a nested loop
grade = ['a','b','c','d','e']

score = [10,20,30,40,50]

for k in grade:
    for x in score:
        print(k,x)

a 10
a 20
a 30
a 40
a 50
b 10
b 20
b 30
b 40
b 50
c 10
c 20
c 30
c 40
c 50
d 10
d 20
d 30
d 40
d 50
e 10
e 20
e 30
e 40
e 50

In [25]:
import pandas as pd

data = {'Name':('Clinton','Daniel','Raheem','Arnold'), 'Age':(18,17,16,15)}

df = pd.DataFrame(data)

df

      Name  Age
0  Clinton   18
1   Daniel   17
2   Raheem   16
3   Arnold   15

In [37]:
#Column Selectiom
import pandas as pd

data = {'Name':('Clinton','Daniel','Raheem','Arnold'),
        'Age':(18,17,16,15),
       'Adress':('Owerri','Ogun','Warri','Lagos'),
       'Qualification':('Msc','MA','MCA','Phd')}

df = pd.DataFrame(data)

#Select Two Columns
df[['Name','Qualification']]

      Name Qualification
0  Clinton           Msc
1   Daniel            MA
2   Raheem           MCA
3   Arnold           Phd

In [40]:
#Row Selectiom
import pandas as pd

data = {'Name':('Clinton','Daniel','Raheem','Arnold'),
        'Age':(18,17,16,15),
       'Adress':('Owerri','Ogun','Warri','Lagos'),
       'Qualification':('Msc','MA','MCA','Phd')}

df = pd.DataFrame(data)

#Select First Row(0)
df.iloc[0]

Name             Clinton
Age                   18
Adress            Owerri
Qualification        Msc
Name: 0, dtype: object

In [41]:
#Reading from a File
import pandas as pd

#Function to read a file(FILE HAS TO BE IN SAME LOCATION)
data = pd.read_csv('employee_records.csv')

data

    Employee Names  Years  Assesment Records  Points  Reward
0      Matthew Ade     25              125.3      21  438.55
1   Angela Adebisi     15               77.9      14  181.77
2  Calistus Ndukwe     10              144.2      18  432.60
3   Martha Martins      9               81.5      25  339.58
4    Victor Sayola     18               77.8      33  427.90
5      Adamu Bello     23               99.5      24  398.00

In [46]:
#Selecting Rows from files
import pandas as pd

data = pd.read_csv('employee_records.csv')

df = data.iloc[0]

df

Employee Names       Matthew Ade
Years                         25
Assesment Records          125.3
Points                        21
Reward                    438.55
Name: 0, dtype: object

In [59]:
#Selecting Rows with Title Header
import pandas as pd
data = pd.read_csv('employee_records.csv')
df = data.head(3)
df

    Employee Names  Years  Assesment Records  Points  Reward
0      Matthew Ade     25              125.3      21  438.55
1   Angela Adebisi     15               77.9      14  181.77
2  Calistus Ndukwe     10              144.2      18  432.60

In [116]:
#Looping Over Rows and Columns
import pandas as pd

dict = {'name': ('Abdul', 'Chukwuebuka', 'Seyi', 'Matt'),
        'degree': ('MBA', 'BCA', 'M.Tech', 'MBA'),
         'score': (90,40,80,98)}

#Creating a DataFrame from a Dictionary
df = pd.DataFrame(dict)

for i, j in df.iteritems():
    print(j)
    print()

0          Abdul
1    Chukwuebuka
2           Seyi
3           Matt
Name: name, dtype: object

0       MBA
1       BCA
2    M.Tech
3       MBA
Name: degree, dtype: object

0    90
1    40
2    80
3    98
Name: score, dtype: int64

C:\Users\K-WrecK\AppData\Local\Temp\ipykernel_31684\629477348.py:11: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i, j in df.iteritems():

In [95]:
#Looping Over Columns
import pandas as pd

dict = {'name': ('Abdul', 'Chukwuebuka', 'Seyi', 'Matt'),
        'degree': ('MBA', 'BCA', 'M.Tech', 'MBA'),
         'score': (90,40,80,98)}

df = pd.DataFrame(dict)

columns = list(df)

for i in columns:
    print(df[i][2])

Seyi
M.Tech
80

In [107]:
#Writing the 'dict' out
import pandas as pd

dict = {'name': ('Abdul', 'Chukwuebuka', 'Seyi', 'Matt'),
        'degree': ('MBA', 'BCA', 'M.Tech', 'MBA'),
         'score': (90,40,80,98)}

df = pd.DataFrame(dict)

columns = list(df)

print(df[['name', 'degree', 'score']])

          name  degree  score
0        Abdul     MBA     90
1  Chukwuebuka     BCA     40
2         Seyi  M.Tech     80
3         Matt     MBA     98

In [109]:
#Saving a DataFrame as CSV file
import pandas as pd

dict = {'name': ('Abdul', 'Chukwuebuka', 'Seyi', 'Matt'),
        'degree': ('MBA', 'BCA', 'M.Tech', 'MBA'),
         'score': (90,40,80,98)}

df = pd.DataFrame(dict)

#Saving it using function
df.to_csv('record.csv')